jackeyjiang/STM32_DGUS/STM32_Demo/rtos/ucos/uC-BSP/bsp.h
#define  BSP_INT_ID_TIM5                                  50    /* TIM5 global Interrupt                                */
#define  BSP_INT_ID_SPI3                                  51    /* SPI3 global Interrupt                                */
#define  BSP_INT_ID_USART4                                52    /* USART4 global Interrupt                              */
#define  BSP_INT_ID_USART5                                53    /* USART5 global Interrupt                              */
#define  BSP_INT_ID_TIM6_DAC                              54    /* TIM6 global Interrupt, DAC1 & DAC2 underrun err int. */
#define  BSP_INT_ID_TIM7                                  55    /* TIM7 global Interrupt                                */
#define  BSP_INT_ID_DMA2_CH0                              56    /* DMA2 Channel 0 global Interrupt                      */
#define  BSP_INT_ID_DMA2_CH1                              57    /* DMA2 Channel 1 global Interrupt                      */
#define  BSP_INT_ID_DMA2_CH2                              58    /* DMA2 Channel 2 global Interrupt                      */
#define  BSP_INT_ID_DMA2_CH3                              59    /* DMA2 Channel 3 global Interrupt                      */
#define  BSP_INT_ID_DMA2_CH4                              60    /* DMA2 Channel 4 global Interrupt                      */

#define  BSP_INT_ID_ETH                                   61    /* ETH  global Interrupt                                */
#define  BSP_INT_ID_ETH_WKUP                              62    /* ETH  WakeUp from EXTI line interrupt                 */
#define  BSP_INT_ID_CAN2_TX                               63    /* CAN2 TX Interrupts                                   */
#define  BSP_INT_ID_CAN2_RX0                              64    /* CAN2 RX0 Interrupts                                  */
#define  BSP_INT_ID_CAN2_RX1                              65    /* CAN2 RX1 Interrupt                                   */
#define  BSP_INT_ID_CAN2_SCE                              66    /* CAN2 SCE Interrupt                                   */
#define  BSP_INT_ID_OTG_FS                                67    /* OTG global Interrupt                                 */

#define  BSP_INT_ID_DMA2_CH5                              68    /* DMA2 Channel 5 global Interrupt                      */
#define  BSP_INT_ID_DMA2_CH6                              69    /* DMA2 Channel 6 global Interrupt                      */
#define  BSP_INT_ID_DMA2_CH7                              70    /* DMA2 Channel 7 global Interrupt                      */
#define  BSP_INT_ID_USART6                                71    /* USART5 global Interrupt                              */
#define  BSP_INT_ID_I2C3_EV                               72    /* I2C3 Event  Interrupt                                */
#define  BSP_INT_ID_I2C3_ER                               73    /* I2C3 Error  Interrupt                                */
#define  BSP_INT_ID_OTG_HS_EP1_OUT                        74    /* OTG HS EP1 OUT global Interrupt                      */
#define  BSP_INT_ID_OTG_HS_EP1_IN                         75    /* OTG HS EP1 IN global Interrupt                       */
#define  BSP_INT_ID_OTG_HS_WKUP                           76    /* OTG HS Wakeup Interrupt                              */
#define  BSP_INT_ID_OTG_HS                                77    /* OTG HS global Interrupt                              */
#define  BSP_INT_ID_DCMI                                  78    /* DCMI global Interrupt                                */
#define  BSP_INT_ID_CRYP                                  79    /* CRYPT crypto global Interrupt                        */
#define  BSP_INT_ID_HASH_RNG                              80    /* HASH and RNG global Interrupt                        */
#define  BSP_INT_ID_FPU                                   81    /* FPU global Interrupt                                 */

/*
*********************************************************************************************************
*                                             PERIPH DEFINES
*********************************************************************************************************
*/

#define  BSP_PERIPH_ID_GPIOA                               0
#define  BSP_PERIPH_ID_GPIOB                               1
#define  BSP_PERIPH_ID_GPIOC                               2
#define  BSP_PERIPH_ID_GPIOD                               3
#define  BSP_PERIPH_ID_GPIOE                               4
#define  BSP_PERIPH_ID_GPIOF                               5
#define  BSP_PERIPH_ID_GPIOG                               6
#define  BSP_PERIPH_ID_GPIOH                               7
#define  BSP_PERIPH_ID_GPIOI                               8
#define  BSP_PERIPH_ID_CRC                                12
#define  BSP_PERIPH_ID_BKPSRAM                            18
#define  BSP_PERIPH_ID_CCMDATARAM                         20
#define  BSP_PERIPH_ID_DMA1                               21
#define  BSP_PERIPH_ID_DMA2                               22
#define  BSP_PERIPH_ID_ETHMAC                             25
#define  BSP_PERIPH_ID_ETHMACTX                           26
#define  BSP_PERIPH_ID_ETHMACRX                           27
#define  BSP_PERIPH_ID_ETHMACPTP                          28
#define  BSP_PERIPH_ID_OTGHS                              29
#define  BSP_PERIPH_ID_OTGHSULPI                          30

#define  BSP_PERIPH_ID_DCMI                               32
#define  BSP_PERIPH_ID_CRYP                               36
#define  BSP_PERIPH_ID_HASH                               37
#define  BSP_PERIPH_ID_RNG                                38
#define  BSP_PERIPH_ID_OTGFS                              39

#define  BSP_PERIPH_ID_FSMC                               64

#define  BSP_PERIPH_ID_TIM2                               96
#define  BSP_PERIPH_ID_TIM3                               97
#define  BSP_PERIPH_ID_TIM4                               98
#define  BSP_PERIPH_ID_TIM5                               99
#define  BSP_PERIPH_ID_TIM6                              100
#define  BSP_PERIPH_ID_TIM7                              101
#define  BSP_PERIPH_ID_TIM12                             102
#define  BSP_PERIPH_ID_TIM13                             103
#define  BSP_PERIPH_ID_TIM14                             104
#define  BSP_PERIPH_ID_WWDG                              107
#define  BSP_PERIPH_ID_SPI2                              110
#define  BSP_PERIPH_ID_SPI3                              111
#define  BSP_PERIPH_ID_USART2                            113
#define  BSP_PERIPH_ID_USART3                            114
#define  BSP_PERIPH_ID_USART4                            115
#define  BSP_PERIPH_ID_USART5                            116
#define  BSP_PERIPH_ID_I2C1                              117
#define  BSP_PERIPH_ID_I2C2                              118
#define  BSP_PERIPH_ID_I2C3                              119
#define  BSP_PERIPH_ID_CAN1                              121
#define  BSP_PERIPH_ID_CAN2                              122
#define  BSP_PERIPH_ID_PWR                               124
#define  BSP_PERIPH_ID_DAC                               125

